
package lecture10ExerciseForLoop;

import java.util.Scanner;

public class P02HalfSumElementVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //от конзолата четем n на брой цели числа
        int n = Integer.parseInt(scanner.nextLine());

        //трябва да намерим най-голямато число и сумата от всички числа, след което от цялата сума да извадим най-голямото число, за да видим колко остава;
        //това, което остава, го сравняваме с максималното число
        int sum = 0;   //създаваме си променлива, която ще ползваме в цикъла, и й задаваме нач. стойност 0, после в цикъла ще й приравняваме други стойности
        int maxNumber = Integer.MIN_VALUE;   //създаваме си променлива, която ще ползваме в цикъла, и й задаваме за нач. стойност най-малкото цяло число; после в цикъла ще й приравняваме други стойности

        for (int i = 1; i <= n; i++) {              //началото на цикъла е 1, краят е n, стойността на променливата ще нараства с единица
            int currentNumber = Integer.parseInt(scanner.nextLine());    //на всяка итерация на цикъла скенерът ще чете по едно цяло число от конзолата

            sum = sum + currentNumber;             //сумата на всички числа е равна на досегашната сума + текущото число  (понеже всички променливи са от тип int, може да се запише и така:   sum += currentNumber;)

            if (currentNumber > maxNumber) {    //ако текущото число е по-голямо от най-голямото до момента, то най-голямо число става текущото число
                maxNumber = currentNumber;
            }

        }


        sum = sum - maxNumber;     //сумата на числата (без да се включва най-голямото число) е равна на сумата от всичките числа - най-голямото число


        if (maxNumber == sum) {               //ако най-голямото число е равно на сумата от останалите числа, в конзолата се печата "Yes" и на нов ред "Sum = "
            System.out.println("Yes");
            System.out.printf("Sum = %d", sum);
        } else {                                          //ако няма такъв елемент, който да е равен на сумата от останалите, се печата "No" и на нов ред "Diff = "
            System.out.println("No");
            System.out.printf("Diff = %d", Math.abs(maxNumber - sum));
        }

    }
}
