package lecture14ExerciseNestedLoops;

import java.util.Scanner;

public class P05SpecialNumbers {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //четем едно цяло число N, въведено от потребителя
        int number = Integer.parseInt(scanner.nextLine());

        //Задачата ни е да намерим всички възможни "специални" числа от 1111 до 9999. За да бъде "специално" едно число, то трябва да отговаря на следното условие:
        //числото N да се дели на всяка една от неговите цифри без остатък.  //Пример: при N = 16, 2418 е специално число:


        //числата от 1111 до 9999 са читирицифрени - следователно имаме вложени 4 цикъла:
        //за да се променят десетиците, трябва да са се извъртели всички единици,
        //за да се променят стотиците, трябва да са се извъртели всички десетици,
        //за да се променят хилядите, трябва да са се извъртели всички стотици
        for (int i = 1; i <= 9; i++) {    //цикъл за хилядите - от 1 до 9 защото цифрите по условие ще са от 1 до 9
            for (int j = 1; j <= 9; j++) {    //цикъл за стотиците
                for (int k = 1; k <= 9; k++) {     //цикъл за десетиците
                    for (int l = 1; l <= 9; l++) {    //цикъл за единиците

                        if (number % i == 0 && number % j == 0 && number % k == 0 && number % l == 0) {         //ако числото, въведено в конзолата, се дели на всяка от цифрите на даденото число без остатък, то е специално число
                            System.out.printf("%d%d%d%d ", i, j, k, l);               //принтираме всяка от четирите цифри на даденото число - те са от тип int, затова ги заменяме с шаблон %d (и оставяме празно място между отделните числа
                        }

                    }
                }
            }
        }


    }
}
