package lecture11WhileLoop;

import java.util.Scanner;

public class P06MaxNumber {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int maxNumber = Integer.MIN_VALUE;      //създаваме си променлива за най-голямо число - като го сравняваме с най-малкото възможно цяло число (за да си осигурим, че някое от въведените в конзолата ще е по-голямо от това)

        //имаме многократно повтарящо се действие - тоест, цикъл - не знаем колко пъти ще се повтори, но знаем докога ще се повтаря -> while-цикъл
        //2 вида входни данни - или текст ("Stop"), или число
        String input = scanner.nextLine();          //в началото си запазваме входните данни като String (в условието е казано, че могат да са или цели числа, или текст)
        while (!input.equals("Stop")) {                      //определяме си условието - докато входните данни са различни от Стоп, влизай в цикъла и изпълнявай кода
            int currentNumber = Integer.parseInt(input);        //ако входните данни не са текст, превърни ги в цели числа и ги запази в променлива от тип int

            if (currentNumber > maxNumber) {                  //ако текущото число е по-голямо от най-голямото до момента, то най-голямо число да стане текущото число
                maxNumber = currentNumber;
            }

            input = scanner.nextLine();            //подканяме на следващото завъртане на цикъла да се прочете нов ред (ако не го направим, всеки път ще се чете първият ред)
        }


        System.out.println(maxNumber);    //принтираме най-голямото число - това е извън цикъла, защото ще го направим само веднэж, а не на всяко завъртане на цикъла
        //System.out.printf("%d", maxNumber);
    }
}
