package lecture11WhileLoop;

import java.util.Scanner;

public class P07MinNumber {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //имаме многократно повтарящо се действие - тоест, цикъл - не знаем колко пъти ще се повтори, но знаем докога ще се повтаря -> while-цикъл
        int minNumber = Integer.MAX_VALUE;      //създаваме си променлива за най-малко число - като го сравняваме с най-голямото възможно цяло число (за да си осигурим, че някое от въведените в конзолата ще е по-малко от това)

        String input = scanner.nextLine();          //в началото си запазваме входните данни като String (в условието е казано, че могат да са или цели числа, или текст)
        while (!input.equals("Stop")) {                      //определяме си условието - докато входните данни са различни от Стоп, влизай в цикъла и изпълнявай кода
            int currentNumber = Integer.parseInt(input);        //ако входните данни не са текст, превърни ги в цели числа и ги запази в променлива от тип int

            if (currentNumber < minNumber) {                  //ако текущото число е по-малко от най-малкото до момента, то най-малко число да стане текущото число
                minNumber = currentNumber;
            }

            input = scanner.nextLine();            //подканяме на следващото завъртане на цикъла да се прочете нов ред (ако не го направим, всеки път ще се чете първият ред)
        }


        System.out.println(minNumber);    //принтираме най-малкото число - това е извън цикъла, защото ще го направим само веднэж, а не на всяко завъртане на цикъла
        //System.out.printf("%d", minNumber);
    }
}
