package lecture12ExerciseArrays;

import java.util.Scanner;

public class P01TrainVersion3 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //това решение е като версия 2, просто тук при стъпка 2. вместо for цикъл ползваме foreach цикъл

        int numberOfWagons = Integer.parseInt(scanner.nextLine());    //от първия ред на конзолата четем едно цяло число, което е броят на вагоните във влака

        //1.създаваме масив
        //в задачата се иска да разберем колко хора има във всеки отделен вагон на влака, както и колко общо хора има в целия влак
        //всички входни данни са от един и същи тип - само цели числа -> можем да ползваме колекция/структура от данни -> масив от цели числа [данните ни трябват като числа (а не като текстове), защото ще извършваме аритметични операции с тях]
        //за да съхраняваме броя на хората, които се качват във всеки отделен вагон на влака, ще създадем целочислен (int) масив с толкова на брой елементи, колкото е броят на вагоните, прочетен от конзолата:
        int[] wagonsArray = new int[numberOfWagons];     //при създаването на масива не сме задали конкретни стойности на елементите в масива, следователно, всичките елементи са с начална стойност 0, тъй като тя е дефолтна за данни от тип int
        //например масивът за момента ще изглежда така: [0, 0, 0]  - с първите входни данни

        //2. присвояваме стойности (които четем от конзолата) на елементите от масива, след което принтираме елементите на масива и намираме сумата от всички елементи
        //трябва да обходим всеки елемент от създадения вече масив и да му присвоим стойност (която четем от конзолата) ->
        //освен чрез for цикъл можем да итерираме/обхождаме елементите на масив и чрез foreach цикъл:
        int totalNumberOfPeopleInTheTrain = 0;     //създаваме допълнителна променлива, която да държи/съхранява общия брой хора в целия влак (с начална стойност 0)
        for (int element : wagonsArray) {      //вместо element можем да пишем например wagon
            element = Integer.parseInt(scanner.nextLine());   //на дадения елемент от масива (на дадения вагон от влака) присвояваме като стойност прочетеното от конзолата число (тоест, прочетения брой хора в този вагон на влака)

            //на всяка итерация на foreach цикъла принтираме брой хора в съответния вагон на влака:
            System.out.print(element + " ");     //System.out.printf("%d ", element);      //всички принтирания са на един ред с интервал между тях

            //на всяка итерация на foreach цикъла към домоментния общ брой хора във влака добавяме хората от съответния вагон:
            totalNumberOfPeopleInTheTrain += element;    //totalNumberOfPeopleInTheTrain = totalNumberOfPeopleInTheTrain + element;
        }

        //3. принтираме сумата от всички елементи на масива
        System.out.println();   //сваляме курсора на следващия ред (тъй като предишните принтирания - тези във foreach цикъла - са на един ред, а искаме следващото принтиране да е на нов/отделен ред)
        System.out.println(totalNumberOfPeopleInTheTrain);     //System.out.printf("%d", totalNumberOfPeopleInTheTrain);     //само веднъж (извън foreach цикъла) принтираме общия брой хора в целия влак (от всички вагони)
    }
}
