package lecture12ExerciseArrays;

import java.util.Scanner;

public class P02CommonElementsVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //когато в даден масив има и текстове, и числа (както е в случая), го определяме/четем като String масив ->
        //защото за конзолата всяко нещо е текст (всичко можем да четем като текст и после, ако е нужно, да го превърнем в число или в символ), но текст не можем да четем като число

        //1. от първия ред на конзолата четем масив от текстове
        String[] firstArray = scanner.nextLine().split(" ");   //елементите на масива имат конкретни стойности, прочетени от конзолата

        //2. от втория ред на конзолата четем масив от текстове
        String[] secondArray = scanner.nextLine().split(" ");   //елементите на масива имат конкретни стойности, прочетени от конзолата

        //подсказано ни е в условието на задачата, че трябва да сравняваме елементите от втория масив с елементите от първия масив (това е важно за реда на принтиране на общите елементи)
        //двата масива не са еднакви (просто трябва да видим дали в тях има някои съвпадащи елементи)

        //3. почваме да взимаме всеки един елемент от втория масив и да го сравняваме с всеки един елемент от първия масив (докато открием същия елемент, или докато свършат елементите в първия масив) -> с 2 вложени foreach цикъла:
        //за да преминем към следваща итерация на външния foreach цикъл (тоест, за да вземем следващия елемент от втория масив), трябва да сме извършили необходимите итерации на вътрешния foreach цикъл (или докато срещнем съвпадащ елемент от първия масив, или докато свършат елементите на първия масив)
        for (String elementSecondArray : secondArray) {      //итерираме по елементите от втория масив (за всеки един елемент от втория масив)
            for (String elementFirstArray : firstArray) {     //итерираме по елементите от първия масив (тоест, за дадения елемент от втория масив взимаме последователно всеки един елемент от първия масив)
                if (elementSecondArray.equals(elementFirstArray)) {   //ако даденият/текущият елемент от втория масив съвпада с дадения/текущия елемент от първия масив
                    System.out.print(elementSecondArray + " ");    //System.out.printf("%s ", elementSecondArray);   //да се принтира съвпадащият елемент    //всички съвпадащи елементи да се принтират на един ред с интервал между тях
                    //може и така:   System.out.print(elementFirstArray + " ");    //System.out.printf("%s ", elementFirstArray);
                    break;   //прекъсваме вътрешния foreach цикъл (след като сме принтирали съвпадащия елемент), за да се прекрати обхождането на първия масив (тоест, за даден елемент от втория масив сме открили съвпадащ елемент от първия масив, няма смисъл да правим други излишни итерации на първия масив)
                }
            }
        }

    }
}
