package lecture12ExerciseArrays;


import java.util.Scanner;

public class P03ZigZagArraysVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int numberOfRows = Integer.parseInt(scanner.nextLine());    //от първия ред на конзолата четем едно цяло число, което показва броя на редовете (с числа), които ще четем

        //по условие ни е казано да си създадем 2 масива - виждаме (от изходните данни), че броят на елементите във всеки масив е толкова, колкото е броят на редовете с числа, които сме прочели
        //тъй като няма да извършваме аритметични операции и/или сравнения с тези числа, можем да си създадем 2 String масива (вместо 2 int масива):
        String[] firstArray = new String[numberOfRows];    //този новосъздаден String масив има numberOfRows на брой елемента - всичките елементи са с начална стойност null (тя е дефолтна за данни от тип String)
        String[] secondArray = new String[numberOfRows];   //и този новосъздаден String масив има numberOfRows на брой елемента - всичките елементи са с начална стойност null (тя е дефолтна за данни от тип String)

        //следва да присвоим стойност на всеки елемент от първия масив и на всеки елемент от втория масив чрез for цикъл (стойностите ще ги четем от конзолата)
        //съгласно примерните входни данни виждаме, че ако редът от конзолата е нечетен, първия елемент от този ред го присвояваме като стойност на текущия елемент от първия масив, а втория елемент от този ред го присвояваме като стойност на текущия елемент от втория масив
        //съгласно примерните входни данни виждаме, че ако редът от конзолата е четен, първия елемент от този ред го присвояваме като стойност на текущия елемент от втория масив, а втория елемент от този ред го присвояваме като стойност на текущия елемент от първия масив

        //на всяка итерация на for цикъла ще четем ред от конзолата - този ред е масив от 2 текста (2 числа, прочетени като текстове) - едното число ще го присвояваме като стойност на елемент от единия масив, а другото число ще го присвояваме като стойност на елемент от другия масив:
        for (int currentRow = 1; currentRow <= numberOfRows; currentRow++) {     //с този for цикъл ще обходим редовете от конзолата - затова почваме от 1 (а не от 0) и краят е <= numberOfRows
            String[] numbersArray = scanner.nextLine().split(" "); // ["1", "5"]   //на всяка итерация на цикъла четем масив от 2 текста
            //"1 5".split(" ") -> ["1", "5"]    //четем цял ред от конзолата като текст, разделяме прочетения текст по интервал и получаваме масив от 2 текста

            String firstNumber = numbersArray[0];   //създаваме си допълнителна променлива firstNumber и като стойност й присвояваме първия елемент от масива (той е на индекс 0)
            String secondNumber = numbersArray[1];   //създаваме си допълнителна променлива secondNumber и като стойност й присвояваме втория елемент от масива (той е на индекс 1)

            // currentRow - 1     -> това е индексът на текущия елемент
            if (currentRow % 2 == 0) {                   //ако редът (с масива) от конзолата е четен (2, 4, 6, 8, ...) ->
                secondArray[currentRow - 1] = firstNumber;     //първия елемент от този ред го присвояваме като стойност на текущия елемент от втория масив
                firstArray[currentRow - 1] = secondNumber;       //втория елемент от този ред го присвояваме като стойност на текущия елемент от първия масив
            } else {            //в противен случай /тоест, ако редът (с масива) от конзолата е нечетен (1, 3, 5, 7, ...)/ ->
                firstArray[currentRow - 1] = firstNumber;   //първия елемент от този ред го присвояваме като стойност на текущия елемент от първия масив
                secondArray[currentRow - 1] = secondNumber;   //втория елемент от този ред го присвояваме като стойност на текущия елемент от втория масив
            }
        }


        //има 2 начина за принтиране (отпечатване) на елементите на всички видове масиви:
        //1. с for цикъл - по index-ите на елементите
        //2. с foreach - по елементите

        //само за String масиви съществува още един начин за принтиране - чрез String.join /този начин за принтиране не важи за int, double, char масиви и други) - и ще го приложим в тази задача:
        System.out.println(String.join(" ", firstArray));      //принтираме елементите на първия масив
        System.out.println(String.join(" ", secondArray));     //принтираме елементите на втория масив
    }
}
