package lecture12ExerciseArrays;

import java.util.Arrays;
import java.util.Scanner;

public class P05TopIntegersVersion4 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //в тази задача трябва да прочетем един целочислен масив и да принтираме тези цели числа от масива, които са топ (top integer)
        //top integer - цяло число, което е по-голямо от всяко следващо число
        //за целта трябва да вземем всяко едно число от дадения масив и да проверим дали вдясно от това число има по-голямо или равно на текущото - ако няма, значи текущото число е топ (top integer)

        //ще сравняваме кой от елементите в масива е по-голям -> тези елементи трябва да са числа, а не текстове
        int[] numbersArray = Arrays.stream(scanner.nextLine().split(" ")).mapToInt(Integer::parseInt).toArray();   //от първия ред на конзолата четем масив от цели числа
        //"1 4 3 2".split(" ") -> ["1", "4", "3", "2"].map -> [1, 4, 3, 2]

        //1 4 3 2   ->  ще проверяваме: дали 1 >= 4,  дали 1 >= 3,  дали 1 >= 2              дали 4 >= 3,  дали 4 >= 2            дали 3 >= 2       2 е последно число в дадения масив и ще е топ (защото вдясно от него няма други числа, с които да го сравним)
        //за целта ще имаме два вложени for цикъла -> във външния for цикъл ще итерираме по всеки елемент от прочетения масив, а във вътрешния for цикъл ще взимаме последователно всеки следващ елемент и ще сравняваме текущия елемент със следващия
        for (int index = 0; index <= numbersArray.length - 1; index++) {     // for (int index = 0; index < numbersArray.length; index++)     //на всяка итерация на цикъла взимаме текущ елемент от масива (от първия ... до последния)

            //има два основни случая - 1. ако текущият елемент не е последен, ще го сравняваме с тези след него; 2. ако текущият елемент е последен, той е топ (защото няма други след него, с които да го сравним)
            if (index != numbersArray.length - 1) {       //ако текущият индекс е различен от последния индекс (тоест, ако текущ елемент е всеки друг елемент с изключение на последния)
                for (int currentNextIndex = index + 1; currentNextIndex <= numbersArray.length - 1; currentNextIndex++) {      //ще обхождаме последователно всеки елемент от масива, който се намира вдясно от текущия елемент (почваме от следващия елемент и стигаме до последния)
                    if (numbersArray[currentNextIndex] >= numbersArray[index]) {     //ако следващият елемент в масива е по-голям или равен на текущия
                        break;     //прекъсваме вътрешния for цикъл (защото вече е ясно, че сме намерили поне едно число, което е по-голямо или равно на текущото число, и е безсмислено да проверяваме останалите следващи числа -> текущото число не е топ)
                        //и след като сме установили, че текущото число не е топ и сме прекъснали вътрешния for цикъл, отиваме на следваща итерация на външния for цикъл (за да вземем следващо текущо число, за което да проверяваме дали е топ), ако има такава
                    }

                    if (currentNextIndex == numbersArray.length - 1) {   //ако този следващ индекс е точно последният индекс в масива     //индексите са уникални, затова ще ползваме тях за условието на проверката
                        //първо написах условието така и беше грешно: if (numbersArray[currentNextIndex] == numbersArray[numbersArray.length - 1])    //ако този следващ елемент (с който сравняваме текущия елемент) е равен на последния елемент в масива    //така написана логиката е грешна, защото може да има няколко елемента с еднаква стойност  [4, 12, 10, 12]
                        //щом сме стигнали до момент, в който следващият индекс е точно последният индекс, значи сме стигнали до последния елемент в масива, значи никъде не сме открили елемент, който да е по-голям или равен на текущия -> значи това текущо число е топ (top integer) и трябва да го принтираме:
                        System.out.print(numbersArray[index] + " ");      //System.out.printf("%d ", numbersArray[index]);        //всички числа, които са top integer, трябва да са на един ред с интервал между тях
                    }
                }

            } else {    //else if (index == numbersArray.length - 1)    //в противен случай (тоест, ако текущият индекс е точно последният индекс)
                System.out.println(numbersArray[numbersArray.length - 1]);   //принтираме текущия/последния елемент (защото той е топ, тъй като няма други елементи след него, с които да го сравним)
            }

        }


    }
}
