package lecture11Arrays;

public class LiveDemo3PuttingValuesToCertainElementsInAnArray {
    public static void main(String[] args) {

        //създаваме масив, чиито елементи са цели числа; броят на елементите в масива е 5, но не посочваме техните стойности
        int[] numbersArray = new int[5];     //всичките пет елемента в масива имат стойност 0, тъй като тя е дефолтна за данни от тип int

        numbersArray[0] = 10;    //на първия елемент от масива (той е на индекс 0) присвояваме стойност 10 (и вече първият елемент в масива е 10, останалите четири елемента имат стойност 0)
        numbersArray[3] = -12;    //на четвъртия елемент от масива (той е на индекс 3) присвояваме стойност -12 (и вече първият елемент в масива е 10, четвъртият е -12, а останалите три елемента имат стойност 0)

        System.out.println();     //в случая не принтираме нищо
    }
}
