package lecture11Arrays;

import java.util.Scanner;

public class P01DayOfWeekVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int number = Integer.parseInt(scanner.nextLine());    //от първия ред на конзолата четем едно цяло число

        //създаваме масив (структура от данни от един и същи тип - в случая данните ще са текстове), в който масив ще съхраним/запазим изходните данни, които целим да получим - по всяко време можем да бръкнем в този масив и да извадим/принтираме този елемент, който ни трябва
        String[] daysOfWeekArray = {"Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"};     //създаваме String масив, като във фигуралните/къдравите скоби посочваме конкретната стойност на всеки елемент на масива

        //проверка -> ако прочетеното число е от 1 до 7 включително, да се принтира съответният ден от седмицата; ако числото не е нито едно от тези числа (от 1 до 7 вкл.), да се принтира "Invalid day!"
        if (number >= 1 && number <= 7) {
            //знаем, че чрез daysOfWeekArray[index] достъпваме конкретен елемент в масив daysOfWeekArray (тоест, достъпваме елемента, който се намира на посочения в квадратните скоби индекс)
            System.out.println(daysOfWeekArray[number - 1]);   //да се принтира този елемент от масив daysOfWeekArray, който се намира на индекс number - 1
            //тоест, за да получим правилния индекс на елемента в масива и за да съответства този индекс на правилния ден от седмицата, пишем индексът да е number - 1

            /* А ако като индекс бяхме написали само number (вместо number - 1) ->
            и ако въведем 0 в конзолата, ще се принтира Monday (вместо Invalid day!); ако въведем 1 в конзолата, ще се принтира Tuesday (вместо Monday); ако въведем 2 в конзолата, ще се принтира Wednesday (вместо Tuesday); ако въведем 3 в конзолата, ще се принтира Thursday (вместо Wednesday);
            ако въведем 4 в конзолата, ще се принтира Friday (вместо Thursday); ако въведем 5 в конзолата, ще се принтира Saturday (вместо Friday); ако въведем 6 в конзолата, ще се принтира Sunday (вместо Saturday);
            а ако въведем 7 в конзолата, ще ни изпише грешка: ArrayIndexOutOfBoundsException и ще уточни, че: Index 7 out of bounds for length 7 (тоест, при дължина на масива 7 няма индекс 7, тъй като индексите на елементите ще са от 0 до 6);*/
        } else {       //else if (number < 1 || number > 7)
            System.out.println("Invalid day!");
        }

    }
}
