package lecture11Arrays;

import java.util.Scanner;

public class P04ReverseAnArrayOfStringsVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);


        String[] inputArray = scanner.nextLine().split(" ");   //от конзолата четем масив от текстове
        //чрез scanner.nextLine() четем цял ред от конзолата като String  и чрез split(" ") го разделяме на масив от String-ове   //например:  "-1 hi ho w"   ->  ["-1", "hi", "ho", "w"]

        //по принцип в задачата се изисква да принтираме елементите от масива в обратен ред
        //като разгледаме по-внимателно, забелязваме, че последният елемент става пръв, а първият - последен; предпоследният елемент става втори, а вторият - предпоследен и т. нат.

        //създаваме си for-цикъл, за да можем да достъпим всеки елемент от масива и да разменим местата на някои елементи; ВНИМАНИЕ!- в случая броят на итерациите в цикъла ще е половината от дължината на масива
        for (int index = 0; index < inputArray.length / 2; index++) {
            String oldElement = inputArray[index];    //създаваме си временна променлива oldElement, в която ще съхраним/запазим старата стойност на текущия елемент от масива (на първата итерация на цикъла променливата oldElement ще пази старата стойност на първия елемент от масива, а на втората итерация на цикъла ще пази старата стойност на втория елемент от масива и т.нат.)

            inputArray[index] = inputArray[inputArray.length - 1 - index];   //на текущия елемент от масива му присвояваме като стойност стойността на този елемент от масива, който е на индекс дължината на масива минус 1 минус текущия индекс
            //тоест, на първата итерация на цикъла на първия елемент от масива му присвояваме стойността на последния елемент от масива, а на втората итерация на цикъла на втория елемент от масива присвояваме стойността на предпоследния елемент от масива и т. нат. колкото пъти се налага

            inputArray[inputArray.length - 1 - index] = oldElement;    //на елемента от масива, който е на индекс дължината на масива минус 1 минус текущия индекс присвояваме като стойност старата стойност на текущия елемент от масива
            //тоест, на първата итерация на цикъла на последния елемент от масива присвояваме като стойност старата стойност на първия елемент от масива, а на втората итерация на цикъла на предпоследния елемент от масива присвояваме като стойност старата стойност на втория елемент от масива и т. нат. колкото пъти се налага
        }

        //след като вече сме разменили местата на елементите в масива (последният е станал пръв, а първият - последен; предпоследният е станал втори, а вторият - предпоследен и т. нат.), просто принтираме елементите в реда, в който са подредени в масива - от първия към последния елемент:
        System.out.println(String.join(" ", inputArray));   //тъй като това е масив от String-ове, за принтирането на елементите можем да ползваме метода String.join - всички елементи да са на един ред с интервал между тях
    }
}
