package lecture9ExerciseDataTypesAndVariables;

import java.util.Scanner;

public class P07WaterOverflowVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //В ТОВА РЕШЕНИЕ НА ЗАДАЧАТА ПРЕДИ ДА ДОЛЕЕМ ЛИТРИ ВОДА В ЦИСТЕРНАТА, ПРОВЕРЯВАМЕ ДАЛИ ЦИСТЕРНАТА ЩЕ МОЖЕ ДА ГИ ПОБЕРЕ (КОЕТО Е НАЙ-ЛОГИЧНОТО РЕШЕНИЕ):

        //по условие ни е дадено, че капацитетът на цистерната е 255 литра вода

        int times = Integer.parseInt(scanner.nextLine());   //от първия ред на конзолата четем цяло число, което е броят пъти, които ще се прави опит да се долива вода в цистерната

        //многократно ще повтаряме следните действия (във for-цикъл):
        //ще четем числа - тоест, текущите литри, които трябва да се добавят в цистерната, и ще проверяваме дали тя ще ги побере или не
        //ако ще ги побере, тогава те ще бъдат изсипани в цистерната и общата вода в цистерната ще се увеличи (ще е равна на досегашната вода + текущо изсипаната);
        //ако няма да ги побере, изобщо даже няма да се изсипват в цистерната

        int sum = 0;   //създаваме си променлива за сумата от литрите вода в цистерната - с начална стойност 0, после ще се променя
        for (int i = 1; i <= times; i++) {
            int currentQuantityOfWater = Integer.parseInt(scanner.nextLine());    //на всяка итерация на цикъла четем текущите литри вода

            //проверка дали ще изсипем текущо прочетеното количество вода в цистерната, или няма да го изсипем:
            if (sum + currentQuantityOfWater <= 255) {    //ако сумата от литрите вода в цистерната + текущите литри, които трябва да се изсипят, ще стане по-малка или равна на капацит. на цист., то текущите литри се изсипват и сумата се увеличава
                sum = sum + currentQuantityOfWater;   //sum += currentQuantityOfWater;   //сумата става равна на досегашната сума + текущо изсипаните литри вода
            } else {   //в противен случай (тоест, ако досег. вода в цист. + текущите литри, които трябва да се изсипят, ще надхвърли капац. на цист., то този капацитет не е достатъчен) текущите литри вода изобщо няма да се изсипят в цистерната
                System.out.println("Insufficient capacity!");
            }
        }

        System.out.println(sum);   //извън цикъла (само веднъж) принтираме натрупаната сума от всички литри вода, които реално са в цистерната
    }
}
