package lecture9ExerciseDataTypesAndVariables;

import java.util.Scanner;

public class P09SpiceMustFlowVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int expectedYieldPerCurrentDay = Integer.parseInt(scanner.nextLine());     //очакван добив от полето за деня (или първоначален брой извлечени подправки от полето)

        //стъпка 1  - ако очакваният добив подправки в полето за деня  >= 100  -> полето е изгодно/печелившо  -> работниците ще работят  - броят на работните дни се увеличава с един   - в края на деня работниците ще изядат 26 подправки  - това значи, че останалите неизядени подправки са равни на наличния брой в началото на деня (добива) минус 26
        //на следващия ден очакваният добив подправки пада с 10 броя в сравнение с предходния ден  - //update на променливата (иначе ще имаме безкраен цикъл)
        //ако очакваният добив подправки в полето >= 100  - ще повторим стъпка 1  - и след като я повторим, ще съберем останалите неизядени подправки от текущия ден с неизядените от предходния ден
        //в цикъла ще намерим (натрупаме) броя на работните дни и броя на добитите и налични (неизядени) подправки през работните дни
        //ако очакваният добив подправки в полето < 100   -> полето не е изгодно/печелившо -> работниците напускат полето, няма да работят този ден, но в края на деня отново ще изядат 26 подправки (от добитите и неизядени подпрвки от предишните работни дни)
        //извън цикъла ще намерим броя на наличните (неизядените) подправки през всичките дни (като тук включваме и последния ден, в който работниците не са работили, но са вечеряли 26 подправки)


        //първоначално не знаем колко ще са итерациите на цикъла (защото не знаем колко ще са работните дни  -> условието е докато полето е изгодно/печелившо, тоест, докато очакваният добив е >= 100)   -> ще ползваме while цикъл
        int workingDays = 0;    //брой работни дни
        int totalAvailableSpicesFromAllDays = 0;    //общо количество налични (добити и неизядени) подправки от всички дни
        while (expectedYieldPerCurrentDay >= 100) {     //докато очакваният добив за деня е поне 100
            workingDays++;    //workingDays = workingDays + 1;    //workingDays += 1;    //броят на работните дни (на текущото поле) нараства с единица
            int availableSpices = expectedYieldPerCurrentDay - 26;    //количеството оставащи (налични/неизядени) подправки (от очаквания/реалния добив вадим изядените в края на деня 26 подправки)
            totalAvailableSpicesFromAllDays += availableSpices;    //totalAvailableSpicesFromAllDays = totalAvailableSpicesFromAllDays + spices;  //намираме сумата от всички оставащи (неизядени) подправки (от всички работни дни)

            expectedYieldPerCurrentDay -= 10;    //expectedYieldPerCurrentDay = expectedYieldPerCurrentDay - 10;     //update на променливата (иначе ще имаме безкраен цикъл)   //на следващия ден се очаква добивът да е с 10 по-малко в сравнение с предишния ден
        }


        System.out.println(workingDays);    //извън цикъла се принтира броят на работните дните
        //System.out.printf("%d%n", workingDays);

        //когато полето е станало непечелившо (очакваният добив е под 100), работниците го напускат, но вечерта отново изяждат 26 подправки - намираме колко реално подправки са останали налични след всички дни (работните дни и последния неработен ден, в който са напуснали полето)
        if (totalAvailableSpicesFromAllDays >= 26) {
            totalAvailableSpicesFromAllDays -= 26;      //totalAvailableSpicesFromAllDays = totalAvailableSpicesFromAllDays - 26;
        }

        System.out.println(totalAvailableSpicesFromAllDays);    //извън цикъла се принтира и общото количество добити и неизядени подправки от всичките дни (работните дни и последния неработен ден, в който работниците са напуснали полето, без да добиват подправки)
        //System.out.printf("%d", totalAvailableSpicesFromAllDays);
    }
}
