package lecture9ExerciseDataTypesAndVariables;

import java.util.Scanner;

public class PMoreExercises04RefactoringPrimeCheckerVersion2 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int number = Integer.parseInt(scanner.nextLine());     //от първия ред на конзолата четем едно цяло число

        //едно число е просто, ако се дели само на 1 и на себе си  (тоест, броят на делителите му е точно 2)  /0 и 1 не са прости числа/
        //по условие трябва да проверяваме дали са прости или не числата, които са в диапазона от 2 вкл. до number вкл.   ->  ще имаме два вложени цикъла:
        //във външния цикъл взимаме текущото число (в диапазона от 2 до number, прочетено от конзолата);
        //а във вътрешния цикъл ще проверяваме това текущо число дали се дели на поне едно число в диапазона от 2 до числото, което предхожда текущото число
        for (int currentNumber = 2; currentNumber <= number; currentNumber++) {        //за да ми е по-удобно, си кръстих променливата currentNumber вместо i

            boolean isPrime = true;      //създаваме си допълнителна булева променлива, която да ни държи истината - приемаме по подразбиране, че числото е просто (тоест, има точно 2 делителя) - затова му задаваме начална стойност true

            //тъй като е ясно, че всяко число се дели на едно и на себе си (тоест, всяко число има задължително поне 2 делителя), с едно и със самото число изобщо няма да проверяваме дали са делители (ясно е, че са такива)->
            //затова директно ще почнем да проверяваме дали текущото  число се дели на 2, после на 3, после на 4 и т. нат., докато стигнем до числото, което предхожда текущото число
            for (int currentDivisor = 2; currentDivisor < currentNumber; currentDivisor++) {     //за да ми е по-удобно, си кръстих променливата currentDivisor вместо j
                if (currentNumber % currentDivisor == 0) {        //ако текущото число модулно се дели на текущия делител без остатък (с остатък 0), значи делението е точно   - следователно, вече сме открили поне един делител повече (тоест, делителите на текущото число вече стават 3), от което правим извод, че текущото число не е просто
                    isPrime = false;          //ако условието е вярно, сме открили, че числото не е просто - и веднага можем да прекъснем вътрешния цикъл
                    break;     //прекъсваме вътрешния цикъл (и отиваме да изпълним кода, който е под него)
                }
            }


            System.out.printf("%d -> %b%n", currentNumber, isPrime);    //на всяка итерация на външния for цикъл принтираме текущото число и срещу него дали е просто (true) или не (false)
        }

    }
}
