package lecture15ExamPreparation1DateAugust2022;

import java.util.Scanner;

public class P06BarcodeGeneratorVersion1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //От конзолата веднъж ще прочетем две цели четирицифрени числа, които показват обхвата на баркодовете, които трябва да променим:
        //•	Първи ред – четирицифрено число – началото на обхвата. Цяло число в интервала [1000…9999]
        //•	Втори ред – четирицифрено число – края на обхвата. Цяло число в интервала [1000…9999]

        //Обаче ние ще разгледаме тези цели числа като String, а не като int
        String startNumber = scanner.nextLine();    //това е началото на диапазона
        String endNumber = scanner.nextLine();   //това е краят на диапазона

        //ще трябва да принтираме тези четирицифрени числа, които са между първото и второто, и които не съдържат четни цифри в себе си
        //имаме повторения, имаме начало, имаме и край, следователно ще знаем колко ще са итерациите на цикъла - значи ще е for-цикъл

        //ще имаме четирицифрено число, затова правим 4 вложени цикъла
        for (int i = startNumber.charAt(0); i <= endNumber.charAt(0); i++) {              //i отговаря за хилядните в числото (тест, за първата цифра от четирицифреното число)
            for (int j = startNumber.charAt(1); j <= endNumber.charAt(1); j++) {              //j отговаря за стотиците в числото (тест, за втората цифра от четирицифреното число)
                for (int k = startNumber.charAt(2); k <= endNumber.charAt(2); k++) {             //k отговаря за десетиците в числото (тест, за предпоследната цифра от четирицифреното число)
                    for (int l = startNumber.charAt(3); l <= endNumber.charAt(3); l++) {            //l отговаря за единиците в числото (тест, за последната цифра от четирицифреното число)

                        if ((i % 2 != 0) && (j % 2 != 0) && (k % 2 != 0) && (l % 2 != 0)) {   //ако всяка от цифрите на четирицифреното число е нечетно число, да се принтира числото
                            System.out.printf("%c%c%c%c ", i, j, k, l);    //искаме числата да са на един ред с разстояние между тях    - разглеждаме променливите като String, а шаблон за единичен символ само е %c (за char)
                        }

                    }
                }
            }
        }


    }
}

