package lecture6ExerciseBasicSyntaxConditionalStatementsAndLoops;

import java.util.Scanner;

public class PMoreExercises05MessagesVersion2 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int numbersCount = Integer.parseInt(scanner.nextLine());   //от първия ред на конзолата четем едно цяло число n, което е броят на числата, които ще прочетем

        //по принцип знаем колко ще са повторенията - колкото е прочетеното от конзолата numbersCount -> най-логично е да ползваме for цикъл
        //обаче можем да решим задачата и с while цикъл:
        while (numbersCount > 0) {        //докато има числа
            String input = scanner.nextLine();     //на всяка итерация на цикъла четем цял ред от конзолата като текст
            //прочетеният текст може да се състои от един, от два, от три или от четири символа - и в четирите случая имаме поне един символ (и той е първият символ от текста)
            int keyboardNumber = Integer.parseInt("" + input.charAt(0));
            //превърнахме символ в текст и после този текст - в цяло число по следния начин:
            //с input.charAt(0) взимаме/наираме първия символ от прочетения текст (и резултатът е променлива от тип char)
            // "" + input.charAt(0)     -> конкатенираме (долепяме) празен String и първия символ от прочетения текст   -> и получаваме String
            //Integer.parseInt("" + input.charAt(0))     -> парсваме получения String, за да го превърнем в цяло число

            String charSet = "";    //създаваме си променлива за възможен текст (поредица от символи), съответстващ на намереното число -> в началото не знаем кой ще е този възможен текст, затова задаваме като начална стойност празен String
            //в зависимост от това кое е числото, ще сетваме съответния възможен текст:
            switch (keyboardNumber) {
                case 2:
                    charSet = "abc";
                    break;
                case 3:
                    charSet = "def";
                    break;
                case 4:
                    charSet = "ghi";
                    break;
                case 5:
                    charSet = "jkl";
                    break;
                case 6:
                    charSet = "mno";
                    break;
                case 7:
                    charSet = "pqrs";
                    break;
                case 8:
                    charSet = "tuv";
                    break;
                case 9:
                    charSet = "wxyz";
                    break;
                case 0:
                    charSet = " ";      //възможният текст е интервал
                    break;
            }

            //на текущата итерация на цикъла от възможния текст (charSet) трябва да вземем и да принтираме само един символ (или първия, или втория, или третия, или четвъртия) -> как разбираме кой символ да се принтира ->
            //от възможния текст (charSet) трябва да се принтира символът, който е на индекса, равен на дължината на прочетения от конзолата текст (input) минус 1
            System.out.print(charSet.charAt(input.length() - 1));
            //чрез charSet.charAt()   взимаме символ на конкретен индекс        //в случая чрез формулата  input.length() - 1    намираме индекса на символа, който трябва дас е принтира
            //например, ако от конзолата прочетем 777, възможният текст е "pqrs"  -> за да намерим символа, трябва да знаем индекса (в случая дължината на "777" e 3, индексът е дължината - 1, тоест индексът е 2  -> това означава, че от възможния текст "pqrs" принтираме символа на индекс 2 - тоест, принтираме символ 'r'

            numbersCount--;    //update     //на всяка итерация броят на числата намалява с единица      //numbersCount = numbersCount - 1;          //numbersCount -= 1;
        }

    }
}
